p_testFiles/blockMeshTesting/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    outerWall
    {
        type            zeroGradient;
    }
    innerWall
    {
        type            zeroGradient;
    }
	frontPatch
	{
		type			zeroGradient;
	}
    backPatch
    {
        type            fixedValue;
		value			uniform 0;
    }
}


// ************************************************************************* //
